import React, { Component } from 'react';
import Markdown from 'react-markdown';

class Base1 extends Component {
    render() {
        return (
            <div>
                <Markdown source={"# 如何进行时间管理？\n" +
                "\n" +
                "译自[How to master your time](https://link.zhihu.com/?target=http%3A//abetterlife.quora.com/How-to-master-your-time-1) \n" +
                "\n" +
                "想像你是一个叫赵三的武学大师。你生命中的最爱——明玉公主——被困在了一个正在燃烧的大楼里，你现在正赶过去救她。\n" +
                "\n" +
                "![Markdown](https://gitee.com/nick070809/pics/raw/master/m1/1e51ef61cfe2b051.jpg)\n" +
                "\n" +
                "不幸的是，在你过去救她之前，一支冲锋队向你开火了。这些激光枪吸引了你的注意力。如果你没能躲开他们，你就会完蛋。你可能认为他们是你解救你的公主路上很紧迫的事情。\n" +
                "\n" +
                "![Markdown](https://gitee.com/nick070809/pics/raw/master/m1/a9a4ce3b1f50f444.jpg)\n" +
                "\n" +
                "这就是你的生活。那些最重要的事情被埋藏在那些无穷无尽的紧急的事情中：\n" +
                "\n" +
                "![Markdown](https://gitee.com/nick070809/pics/raw/master/m1/437bae293da818e2.jpg)\n" +
                "\n" +
                "回顾一下你每天都在做的事情。我猜，**大部分不是你选择的事情，大部分是需要你做的事情**。下面讲一下如何解决这种事情：\n" +
                "\n" +
                "1、学会拒绝：大部分人在遵守一种隐藏的社会道德——当有人请你帮忙的时候，你总是要说——YES。这可能听起来很高尚，但是别忘了有一个快要死去的公主等着你去救命呢，就因为别人很礼貌的请你帮忙，你就可以慢下来。\n" +
                "\n" +
                "2、远离手机：如果你长达7年不玩手机，你就会比那些每周平均花费34个小时在手机娱乐上的人来说多了12376个小时。我当然也会用手机娱乐，但是只是在休息的时候看上半个小时，但是只有半个小时。你可以使用12000个小时做很多事情，追赶上那些疯狂的人。\n" +
                "\n" +
                "3、关掉通知：现代科技已经进化到可以利用我们对紧急事情的嗜好了：邮件，微博，QQ，知乎等等争先恐后的抢走你的注意力。幸运的是，有一个简单的方法可以解决它：关掉所有的通知。当你有时间思想不集中的时候再去处理那些事情，比如饭后休息的时候，然后把那些事情集中解决，这样可以节省时间。\n" +
                "\n" +
                "4、为你的事情的优先级做计划：人类是种很有趣的生物，如果你要去见朋友，你得安排一个确定的时间去看他，但是如果你有一些事情恰恰是和你自己有关系，比如写一本书，或者去健身房，那么你却不会安排好日程。你就是想避开它。把你优先级最高的事情视作你要赶上的航班：预先约定好时间，然后对所有阻挡你的航班的事情说不。\n" +
                "\n" +
                "5、最重要的事情先做：你现在能做的最重要的事情（不是最紧急的）是什么？今天做一部分。记住分散你注意力的冲锋队是无穷无尽的，**别用“我就先做这些事情，一会做那些最重要的事情”这样的想法骗自己**。你不是靠这些借口活着的。\n" +
                "\n" +
                "6、更多的时间，更少的事情：你可能同时正在做成百上千件事，有一个小诀窍是一天最多做1到3件事，而且持续为之努力。你的大脑不喜欢这个限制，其他人也不会喜欢这个限制。但是无论如何这样做。把自己的注意力放在一件事情上要比同时做多件事要有效率的多。为熟练自己的工作多匀一点时间出来。\n" +
                "\n" +
                "7、忽略：这是很粗鲁、不道德但是却相当必要的。总是有些人你是没空去搭理他们的。你必须允许自己忘记一些请求。**你可以晚一点去做打扫、付帐单、回复邮件这些事情。这个世界是不会崩溃的。而这样做的报酬是——你完成了那些真正重要的事情。**\n" +
                "\n" +
                "\n" +
                "\n" +
                "关于赵三的最后一堂课是——**他们是英雄**。"}/>

            </div>
        );
    }
}

export default Base1;