import React, { Component } from 'react';

class CTO2 extends Component {
    render() {
        return (
            <div>
                <h2>做 CTO，需要注意什么？</h2>
                <p><strong>一、做 CTO，薪资收益是涨是跌？</strong></p>
                <p>去创业团队首要考虑的就是创始人的能力和性格。一个好的创始团队，即使是放弃暂时的高薪，降薪去入伙创业也是值得的，这样的例子在现实生活中我也遇到过不少。</p>
                <p>做 CTO 潜力的：能力突出、能带团队的工程师，薪资比做开发时高出一截。</p>
                <p>很多找 CTO 的创始人会说，现在创业大家没钱，我给股份期权啊！</p>
                <p>关于股份期权的话题，我会在第三部分详细说说，大家继续往下看。</p>
                <p><strong>二、什么样的工程师适合做 CTO？</strong></p>
                <p>什么样的工程师适合做 CTO? </p>
                <p><strong>答案是「两专多能」。</strong></p>
                <p><strong>所谓两专</strong>，<strong>一是技术水平突出，二是善于团队带领管理。</strong></p>
                <p>善于带团队是一门高难度的艺术——要能把握开发进度；要能照顾开发团队成员，带领大家一同进步；要能对接好产品、运营、商务、当然还有自己的组员和boss。</p>
                <ul>
                    <li>向其他团队承诺把控好开发进度</li>
                    <li>带领开发团队少加班，没有紧急情况就不加班</li>
                    <li>当其他创始人或产品团队要求开发团队加班赶进度时，判断需求是否非常重要紧急，如果是不合理的加班要求就婉言拒绝，以合理的言辞言明利弊</li>
                    <li>当面临必须要赶进度的重大任务时，向开发团队说明事情重要性，让大家无论是心里还是行动上都愿意留下来加班</li>
                    <li>为自己团队争取利益，避免公司部门斗争中影响到自己团队。</li>

                </ul>
                <p><strong>简而言之，一个能带好团队的 CTO 必须要具备人格魅力。</strong>在开发团队的成员面前，承担一个有责任感的带头大哥风范。某创业公司 CTO 因为和其他创始人理念不合，决定离开公司时，开发团队有不少人决定追随他的脚步离开公司，也从侧面佐证了他作为领队者的魅力所在。</p>
                <p>以上说了「两专」，除此之外，做 CTO 还要会做很多事情：比如技术选型、招聘新人等等，不能有能力上的短板。</p>
                <p><strong>三、前人的经验：去创业公司前一定要考虑这几点</strong></p>
                <p>前两部分讨论了钱的问题和能力的问题，最后说说要不要去的问题。</p>
                <p>去创业团队首要考虑的就是创始人的能力和性格。一个好的创始团队，即使是放弃暂时的高薪，降薪去入伙创业也是值得的，这样的例子在现实生活中我也遇到过不少。</p>
                <p><strong>所以我一直推荐工程师和熟悉的朋友一起创业，知根知底，了解他的能力和为人。</strong></p>
                <p>当然，我也遇到工程师这样说：不要和好朋友一起创业。本来是朋友的人，因为创业最后连朋友也做不成。</p>
                <p>如果要加入以前不熟悉的团队，考虑以下几点是很重要的：</p>
                <ol>
                    <li><p>创始人的能力重要，人品更重要</p>
                        <p>创业团队，很多承诺只是口头协议，日后能不能兑现全在创始人的人品。</p>
                    </li>

                </ol>
                <ol start='2' >
                    <li><p>大饼要不要吃</p>
                        <p>期权不是股权，而是一份按照约定价格在约定时间购买股份的合同。但如果说给期权，一定要落在纸上，口头承诺是没有任何意义的。</p>
                    </li>

                </ol>
                <p>&nbsp;</p>
                <ol>
                    <li>注意力放在人上，不要只是盯着技术，多把工作指派出去</li>
                    <li>不要追赶技术潮流，靠谱的技术就是好技术</li>
                    <li>保证技术能够给公司带来价值 </li>

                </ol>
                <p>&nbsp;</p>
                <p>我不在乎你的个人成功，我在乎的是你团队成功。作为领导，你的职责是使他们成功。</p>
                <p>&nbsp;</p>
                <p><strong>CTO 最核心的职责是什么？</strong></p>
                <p>保证核心产品能够保质按期发布。</p>
                <p>&nbsp;</p>
                <p><strong>CTO 到底需不需要coding？</strong></p>
                <p>不需要，早期除外。</p>
                <p>&nbsp;</p>
                <p><strong>CTO需不需要懂编程？</strong></p>
                <p><strong>CTO 必须懂编程，很懂编程。</strong></p>
                <p>&nbsp;</p>
                <p><strong>CTO 要不要参与做核心技术的选型？</strong></p>
                <p><strong>只有在自己擅长的领域内或者团队没法自己做出有效决策的情况下才介入。</strong></p>
                <p>&nbsp;</p>
                <p><strong>CTO 要不要参与代码审查(Code Review)？</strong></p>
                <p>首先，不积极推动 Code Review 的 CTO 不是合格 CTO。明显没有全局化视野和对长期效率的深入思考。 有了 Code Review 的机制后，我建议CTO应该经常看看核心部分的代码，以保持对于自己团队代码的熟悉程度。</p>
                <p>&nbsp;</p>
                <p><strong>CTO是否应该参加核心系统的架构讨论？</strong></p>
                <p>应该。</p>
                <p>&nbsp;</p>
                <p><strong>CTO该不该主导工程师文化和制度建设</strong></p>
                <p>CTO 的主要职责之一。</p>
                <p>&nbsp;</p>
                <p><strong>CTO应不应该经常走出去和外界交流？</strong></p>
                <p>虽然并非必须，但这是区别于一个合格 CTO 到卓越 CTO 的重要的点。</p>

            </div>
        );
    }
}

export default CTO2;