import React, { Component } from 'react';





class DYH extends Component {
    render() {


        return (
            <div>
                <h2>Direct Your Heart</h2>
                <p>这一篇无关技术，每周和我们打交道最多的是周围的同事，如何和他们很好的沟通，以及延伸到家庭，生活中；</p>
                <p></p>
                <h3>情商</h3>
                <p>1、<strong>思考他人的行为</strong></p>
                <p>说话时看着对方的面部，留意他的发音，衣着，身材，发型甚至胡须是否整齐；做事的效率，是否是聪明的人，区分他对事物的看法是积极还是消极，是否有独到的见地。</p>
                <p>2、热情</p>
                <p>热情的表现，主动表现自己，可能没那多事情需要积极的表现自己，但当一个机会来临的时候，你的热情会帮助抓住这个机会。</p>
                <p>3、清楚自己的长处和缺点</p>
                <p>利用自己的长处显示出强势的一面，并对缺点不断的完善</p>
                <p>4、平静的面对过去</p>
                <p>根本没有时间去后悔。放下过去，着眼当前</p>
                <p>5、最快找到有效方法解决问题</p>
                <p>聪明和价值的体现，并及时考虑实施性与完备性</p>
                <p>6、对未来充满信心</p>
                <p>同平静的面对过去一样，不会因为政策的不公而消极无为，不会因为室友天天打游戏而随波逐流，不会因为产品市场的不确定而脾气暴涨；<strong>需要做的事情是做好准备迎接不可预料的挑战</strong></p>
                <p>7、<strong>体会这一刻</strong></p>
                <p>时而思考一下，今天有什么收获，今天损失了什么</p>
                <p>8、不要让别人影响你的情绪</p>
                <p>情商高的人不会让自己的消极情绪影响自己。他们会主动寻找自己不开心的原因，最重要的是，他们会想办法让自己开心起来。</p>
                <p>9、能自如地和朋友以及陌生人交谈</p>
                <p>不在乎陌生人的年龄、种族、宗教、性别、性取向或者政治立场；了解他们，也是另一片蓝天</p>
                <p>10、在必要的时候敢于说不</p>
                <p>商高的人知道即使是面对好东西，也要把握适度的原则。他们知道自己不可能做到所有事情，所以会优先处理最重要的事。</p>
                <p>11、经常思考关于感受的问题</p>
                <p>高情商者都是爱思考的人。你是否经常问自己类似这样的问题：“我为什么会说出这样的话？”或是“我是不是有点冲动？” ，&quot;冲动带来了什么坏结果？&quot;</p>
                <p>对各种情绪和反应有了清醒的认识后，你就会对情绪问题更加注意，而且你还可以利用这种信息为你带来优势。</p>
                <p>12、<strong>善于询问别人的看法</strong></p>
                <p>你眼中的自己和别人眼中的你是有很大区别的，如果不知道如何组织优雅的问句，简单点可以为<strong>“你觉得是不是这样？”</strong></p>
                <p>13、<strong>积极探索原因</strong></p>
                <p>“他为什么会有这样的感觉？”或是“这事背后到底有怎样的隐情？”</p>
                <p> 14、<strong>不给人贴标签</strong></p>
                <p>有些人没有考虑事情的前因后果以及一些情有可原的外部因素，便对其他人很快下了定论。这是一个非常有害的习惯。</p>
                <p>而你明白每个人都有过得不顺心的时候，有人甚至一整年过得都不顺。如果你不随便给别人贴标签，你就能够对他们保持比较客观的看法，这样你也能从各种关系交往中获得最大的效益。</p>
                <p>15、善于化解尴尬</p>
                <p>说真话常常会让聊天陷入无话可聊的处境，我们需要更多的说话技巧，带出一个新的话题，或是组织一段搞笑的语句；在化解尴尬也是一样，如果直白的劝架一般也不会得到预想的效果。古人在教授道理时候，经常会构造一段小故事。</p>
                <hr />
                <h3>处事之道</h3>
                <p>低调做人，高调做事；</p>
                <p>说说我对这几个字的理解</p>
                <p>低调做人，这个比较好理解，不要在同事面前抱怨公司制定，宣泄谁谁怎么样，不要做违背公司职责的事情，枪打出头鸟这个道理想必都知道。</p>
                <p>高调做事，并不是雷声大雨点小，从事软件开发可以这么理解，在我架构设计的时候，要考虑多种场景，扩展性如何?；在我编码的时候，容错了多少不合规输入，系统依然能正确的返回？；在我部署的时候是否有回滚策略？；在系统繁忙时是否有降级处理？；在新系统上线时是否有紧急预案？ 考虑的越全面，需要的资源就越多，为了争取这些资源，我要凸显这些事情的重要性，才能被重视。</p>
                <hr />
                <h3>说话之道</h3>
                <p>一个非常重要的观点——<strong>你说什么样的话，你就是什么样的人</strong>。一个人说话方式是可以透露出他所在的行业、自身性格，说话给人的感觉也是让别人认识你的一些重要信息。</p>
                <p><strong>储备知识，肚中有料</strong></p>
                <p>能浅能深</p>
                <p><strong>逻辑清晰</strong></p>
                <p>说话有因果关系，经得起推敲，不要引入一些无关的东西进来</p>
                <p><strong>换位思维</strong></p>
                <p>考虑受众如何能较快get到点</p>
                <p><strong>说话方式</strong></p>
                <p>说话前，最好考虑你说话的目的：破冰，提升关系，解释问题，八卦</p>
                <p><strong>技巧</strong>，都是为了吸引</p>
                <ul>
                    <li><strong>惊奇法</strong>:你是怎么做到的？你怎么这么白？你做事的效率太高了！你这个nb了！</li>
                    <li><strong>反差法</strong>:你不知道，这个小车可以装下50个人吧？</li>
                    <li><strong>选择的自由</strong>:“甜点有芒果布丁和抹茶冰激凌，你要哪种？” </li>
                    <li><strong>非你不可</strong>:“老张啊，这次没你不行啊，一定要来！”</li>
                    <li><strong>团队化</strong>:走，下午我们一起去打篮球</li>
                    <li><strong>假设法</strong>:你是不是有个哥哥，因为你这么粘人。</li>
                </ul>
                <p>&nbsp;</p>
                <p>&nbsp;</p>
                <p>不要问她有没有时间，不要问她要不要饮料，不要问她你家里几个人，不要问她你年纪多大了，不要问她情人节怎么过，不要问她吃饭了没有</p>
                <p>下午我们去看电影吧？</p>
                <p>你要喝什么饮料？</p>
                <p>你是不是有个弟弟？</p>
                <p>你才25岁吧?</p>
                <p>今天情人节，我给你准备了个惊喜</p>
                <p>我买了牛逼炸酱面，过来一起吃。</p>
                <p>&nbsp;</p>
                <p>不要问她为什么不回微信，还没有get到点。</p>
                <hr />
                <h4>so</h4>
                <p>没有那么容易的事</p>
                <p>也没有那么难的事</p>
                <p>这里有个问题</p>
                <p>这里是这样的</p>
            </div>
        );
    }
}

export default DYH;