import React, { Component } from 'react';





class GoodNight extends Component {
    render() {
        return (
            <div>
                <p>[转]想与你说晚安</p>
                <p>1.</p>
                <p>有时候在微信上跟朋友聊天聊到兴起的时候，最不想看到的就是他们突然发来的“哦”或者是“呵呵”两个字。</p>
                <p>那种感觉就像是我迫不及待的打开了一块糖塞进了嘴里，正要慢慢享受它的香甜，却一不小心把它恰在了嗓子里，满满的兴致瞬间都变成了失望，再也不想多说一句。</p>
                <p>那些在你心里无比重要不可代替的人，总是会从一些小细节里告诉你，其实对方并没有把你看的足够珍贵。</p>
                <p>喜欢你的人，可能会在微信上秒回，就算是他因为忙没有及时回复，也会在他闲下来的时候，告诉你他去做了什么；
                    他不会在你特别有倾诉欲的时候消失，而是耐心陪着你，认真看你发过去的每一个字；</p>
                <p>也不会在你聊的兴起的时候突然消失，如果临时有事，他会跟你说明理由，不会让你胡思乱想。</p>
                <p>不爱你的人，可能会觉得你是生活里极其多余的存在吧。
                    你的一腔热血到了他那里会处处碰壁，他不愿去猜你的小心思，你的情话都变成了废话。你的嘘寒问暖换来的都是冷漠，对方回复的每一句都没有温度。</p>
                <p>2.</p>
                <p>我问过身边的一些朋友，他们分手的原因，大多数人的理由，都是说因为他变了。这种变化是从一言一行里表现出来的，你自己能真实感受到的。</p>
                <p>就像前段时间特别流行的，男生和女生在一起前三个月和在一起三年的变化，不过几张图片而已，在看完后却让人唏嘘不已。</p>
                <p>很多男生在刚开始追你的时候，他去洗个澡恨不得都会拿着手机进浴室。你提起自己想要去哪家餐厅吃饭，他会回你，“好啊，今晚有时间吗，我带你去”。</p>
                <p>你想要买一条裙子，发过照片让他好不好看，他回复了一句“我买来送你吧”。他去忙工作的时候，会提前告诉你“我过会儿再找你，手头上有些事情要处理”。</p>
                <p>那时，他的每一句话都走在了你的心坎上，温暖贴心，并不会担心两个人只有今天没有明天，只会觉得眼前这个人对自己的爱是沉甸甸的。</p>
                <p>可是后来，他开始变得没有耐心，你发过去十句话，换来的可能是一个表情包，或者是漫不经心的一句“哦”“好”“嗯”。</p>
                <p>3.</p>
                <p>你还是一如既往的跟对方分享着自己的生活，乐此不疲的。但是对方早已经不感兴趣了。他在微信上给你的回复永远是“忙”“你自己看着办”“我就不陪你了，没时间”。</p>
                <p>就连你跟他提起自己最近感冒了，鼻子有些不舒服，可能换回来的也只是他的一句“这样啊，那你记得吃药”，而同样的事情换做是以前，他回你的可能就是 “你很难受吗，我带你去医院吧”。</p>
                <p>他不爱你的时候，就算你提出分手，他也依然会语气冷淡，连一句挽留的话都懒得说，只是在微信上发一句“随便你吧”。这四个字，看似不经意，但却最伤人。</p>
                <p>其实爱情里最令你绝望的，是你发现眼前这个曾经许诺给你美好诺言，也曾把你捧在手心里的人，突然就变得陌生起来。你不能无视过去的那些美好和甜蜜，但是你也必须承认，他就是没过去那么爱你了。</p>
                <p>4.</p>
                <p>很多人总是问我，爱一个人，应该是什么样子的？
                    我觉得应该是：有话可说，有事可做。</p>
                <p>当你喜欢一个人，把他当成生活里的一部分的时候，就是会情不自禁的想跟他分享，迫不及待把过去和未来一股脑的讲给他听。</p>
                <p>如果一个人喜欢你，也会是如此吧。他主动联系你，对你说早安晚安。把一天当中的喜怒哀乐，所经历的一点一滴，都会啰里啰嗦的讲给你听。</p>
                <p>即使时间过去了，所有的事情都已经成为平淡，但最重要的是，他绝对不会冷落你，忽视你的感受。</p>
            </div>
        );
    }
}

export default GoodNight;