import React, { Component } from 'react';





class PeopleHistory extends Component {
    render() {
        return (
            <div>
                <p>早在历史纪录出现前，250万年前就出现了类似现代人类的动物，如果你穿越到200万年前的东非看，你会看见一群很像人类的生物：有些妈妈一边哄着小婴儿，一边还得把玩疯的小孩抓回来，忙得团团转；有些肌肉猛男捶着自己的胸膛，只希望旁边的美女能够垂青；也有年长的智慧大家长，对这早已习以为常。</p>
                <p>远古人类已经懂得爱和玩乐，能够产生亲密的友谊，也会争夺地位、权力，不过这和黑猩猩和狒狒并没有太大的区别。</p>
                <p>智人只是远古人类“科”的一种，有着许多的表亲。</p>
                <p>最早的人类大约从从250万年前开始演化，在大约200万年前出现了在欧亚大陆的“尼安特人”和在东亚的“直立人”，适宜热带环境的印度尼西亚的“梭罗人”，等等各种在不同环境下生存的远古人类。200万年前到一万年前为止，存在着多种不同人种。</p>
                <p>虽然人种之间有诸多的不同，但还是有几项共同的人类特征。其中最重要的一点就是人类的大脑明显大于其它的物种。对于60公斤的哺乳类来说，平均脑容量200立方厘米，但早在250万年前的男女就有了600立方厘米，至于现代的人类更高达1200～1400立方厘米。</p>
                <p>这似乎说明了一件事情那就是脑容量越来越大是物尽天择的选择，巨大的脑容量能带来强大的力量。</p>
                <p>然而事实真的如此吗？</p>
                <p>智能到底是生物进化的最终目的，还是只是目的之一呢？</p>
                <p>事实上自然选择与智能发展没有一点关系。由于物种生存环境和繁殖速度的差异，生物进化的过程也有所不同，随着时间的推移，为了在特定环境，时期下生存繁衍，有机物需要改变他们的设计。出了成功适应，它们别无选择。。。生活是枝繁叶茂的灌木丛，而不是天平或者梯子，生物体在分支的顶端，而不是底层。进化带来的改变也并不总是朝着提升智慧的方向前进——它们朝各自的方向发展。很多例子表明，几百万年来，某些生物未曾发生改变，例如，上溯到几千万年前的爬行动物鳄鱼以及更加古老的微生物，但它们却存活至今。但是，在进化过程的不同分支中，往提升智能的方向前进确实是分支之一。</p>
                <p><strong>庞大的大脑同时也是一个庞大的负担。</strong>大脑的结构脆弱，原本就不利于活动，更别说还的用个巨大的头骨把它装着。大脑体重占比约2～3%，但在身体休息不活动时却消耗25%的能量，比猿类的8％高出数倍。为此不得不作出的牺牲是，第一花更多时间去寻找食物，其次是肌肉的退化萎缩。</p>
                <p><strong>但不可否认的是量变产生质变，大脑的容量可以说是诞生高级心智模式的基础</strong>，也就是说大的容量不一定能产生高认知能力的心智但高等级的心智必须要足够大的脑容量。智能涉及到的因素多而杂，就像对与一台计算机来说计算能力只是最底层最基础的组成部分。</p>
                <p>同为哺乳动物的海豚，拥有比现代智人大20%左右的脑容量，远超远古人类，拥有超越猿类的学习能力，在很多领域的认知能力超过人类，但为什么海豚没有像智人那样发展出文明呢？答案是人类拥有双手，<strong>手是将智能外化的一种重要工具</strong>，直立行走是让我们空出了双手，并在不断的使用中把更多的神经注入到双手中与大脑相连，我们因此能利用工具来扩展自身的能力，而其它物种的能力决定于自身的身体：像是肌肉力量，牙齿大小、翅膀的宽度等，虽然动物能利用风和海流，却无法控制这些自然的力量，无法突破先天的身体限制。</p>
                <p><strong>人类不断进化就是我们发展更高效的工具扩展自身能力过程</strong>，拿现在来说个人电脑和智能手机已经将我们的大脑连入网络，而对于现代人来说网络实质上是我们共享的一个云端的大脑，已经成为我们智能的一部分。</p>
                <p>让我们再回到大脑本身的进化来看。<strong>对于大脑来说新皮质的是一个里程碑式的进化</strong>。新皮质就是大脑外层的一种物质，是用来进行模式别的重要部分。一旦生物进化遇到能够进行分层学习的神经机制，该生物的大脑就会随着时间的推移逐渐适应改变的环境，<strong>但没有新皮质的物种只能通过代际遗传来继承这种能力</strong>。没有新皮质的物种需要几千年的时间才能学会具有跨时代意义的新行为——就植物来说，新行为指适应环境的方法，之后这个方法会向病毒一样迅速传播至整个种群。6500万年前的白垩纪第三纪灭绝事件使得很多没有新皮质的物种迅速灭绝，因为这些物种不能很快适应快速改变的环境。这标志着拥有新皮质的哺乳动物开始取代它们的生态主导地位。</p>
                <p>在这里又出现了一个问题，人类进化的速度为什么远远高于其它哺乳动物？黑猩猩到现在仍然和几十几百万年前并无太大差异呢？为什么尼安特人拥有比智人更大的大脑和更强壮的身体却也被智人所征服？</p>
                <p>我想这和语言密不可分。<strong>语言的进化在某种程度上说就是智能的进化</strong>。智人的语言并不是世界上第一种语言。每种动物都有着自己的语言，就算是作为昆虫的蚂蚁、蜜蜂又有着极精密复杂的沟通方式，能够告知彼此食物所在。甚至，智人的语言也不能说是第一种有声语言。虽然智人能发出的声音很多，但鲸鱼和大象能发出的声音也不遑多让，鹦鹉几乎能模仿出人类所有声音，甚至手机铃声都不在话下，那人类的语言特别在哪呢？</p>
                <p><strong>人类语言最独特的功能，并不在于能够传达关于人或野兽等实体存在的事物的信息，而是能够传达关于一些根本不存在的事物的信息</strong>。据我们所知，只有智人能够表达关于一些从来没有看过、碰过、耳闻过的事物，而且讲得煞有其事。</p>
                <p>至于为什么会突然出现这种神奇的状况，有这样一个解释，在大脑的进化过程中一次偶然的基因突变，改变了智人大脑的连接方式，让他们用前所未有的方式思考，<strong>用完全新式的语言来沟通——“虚构”这种新的能力</strong></p>
                <p><strong>“虚构”的能力重点不只在于让人类能够拥有想象，更重要的是可以“一起”想象，编织出种种共同虚构的故事</strong>，不管是《圣经》的《创世记》还是现代所谓的国家、法律、公司等都是想象。这种虚构的故事赋予了人类前所未有的能力，让我们得以集结大批人力、灵活合作。最重要的一点是让我们的协作对象从熟悉的个体到无数的陌生人。</p>
                <p><strong>在没有“虚构”能力之前，人类通过互动，情感交流来维持团体的稳定的数目大约是150人，只要超过这个数字就很难深入了解其他人并且去信任对方</strong>。即使到了今天我们依然受到这个神奇的数字影响。只要在150人以下，不论是社群、公司、社会网络、还是军事单位，只要靠着大家都认识、彼此互通消息，就能够运作顺畅，而不需要规定出正式的阶层、职称、规范。靠着人际关系就能比较顺畅的运作。也就是150是我们最多能进行情感交流的人数，这也是“Path”（一款美国的社交软件，每个用户最多只能添加150作为好友）在上线后短短3周就斩获百万级用户的原因，因为这款软件看见了人们存在于根里的情感交流的需求以及在超过150人后就不能用情感交流和互动来充分认识彼此所引发的隐隐不安感。</p>
                <p><strong>社群一旦突破了150人事情就大大不同了，难以再靠人际关系和情感交流来维系，这也是很多创业公司A轮之后在管理上出现巨大问题而失败的原因</strong>。如果你在小公司呆过你一定能感受到人际关系对你的巨大影响，更多时候我们被感情所羁绊。</p>
                <p><strong>虚构赐予了人类“团结的力量”</strong>，从部落守护神到城市再到帝国的虚构想象，种种虚构的存在让就算是大批互不相识的人，只要相信某个故事就能共同合作，这是放在之前简直就是天方夜谭。两个互不认识的塞尔维亚人，只要都相信塞尔维亚国家主体、国土、国旗缺失存在，就可能冒着生命危险拯救彼此。至于司法制度，也是立基于法律故事。从没有见过对方的两位律师，还是能同心协力为一位完全陌生的人辩护，只因它们都相信法律、正义、人权确实存在。</p>
                <p>（当然他们也相信律师费的存在）</p>
                <p>拿众创写书举例，一群来自各个领域且素未谋面的人，因为对于一本书的将在未来被出版的想象而紧密合作，只因为我们有一个共同的信念，相信认知盈余的力量会使得我们完成这件创新的事情，就像曾经的维基百科那样。</p>
                <p>这也是为什么几人拿着一份ppt就能拿到巨大的资金，召集一群人为了一个存在于幻想的idea彼此紧密协作不分昼夜。</p>
                <p>想想天主教是如何被创造出来的呢？说穿了，就是<strong>讲故事</strong>，在说服听众去相信这些故事。然而说出有效的故事并不容易。难的点不在于讲故事，而在于要让别人相信。那些擅长说故事的人就是远古时期的巫师般，拥有常人所不具备的魔法能改变世界，并因此得到别人的信任获得权力与财富。</p>
                <p>多年来，人类已经编织出了一个极其复杂的故事网络。这个网络中，像Google,Microsoft公司这种虚构的故事不仅存在，而且力量强大。虽然其实所谓联合国、利比亚和人权都只是我们想象出来的概念，但在2011年，我们说联合国要求利比亚政府尊重其公民的人权，没有人会觉得这是句谎话。</p>
                <p>在我们学会了讲故事这个强大的虚构手段之后，智人就一直生活在双重现实之中。一方面，我们有像是河流，树木和狮子这种确实存在的客观现实；另一方面，我们也有像是神、国家、企业这种想象中的现实。</p>
                <p><strong>而这些想象的延续被我们称之为“文化”，这就像一种新形式的基因，也有人称之为“模因”，拥有比基因快上千万倍的进化速度，可以这么说因此我们开启了除开基因的一个新的演化路径“文化演化”</strong>，这条路比永远在堵车的基因演化路要快得多，因此得以日行千里，将其它物种远远抛在脑后。</p>
                <p><strong>“文化”形成的关键材料叫“思想”，思想保留了生物体的某些属性。</strong>与生物体一样，思想也倾向于维持其结构并繁衍生息；它们也可以融合，重组或者分离其内容；甚至它还可以进化，而在这个过程中，选择淘汰扮演着重要的角色。</p>
                <p><strong>思想生发思想，并帮助进化出新思想</strong>。思想不仅彼此互动，也与其它心智力量互动，而不论这是来自同一大脑中，还是在附近的大脑中的，又抑或是网络这种新型的心智。思想还与外部环境互动，从而产生某种进化历程中前所未见的飞跃性进步。</p>
                <p><strong>可以看得出来智能的进化之路在于“思想”与“思想”的融合与新生，而思想是心智的产物，心智即是认知世界的本质方式，人类心智只是许多心智中的一种</strong>，每个人的心智都不同，<strong>我们的心智在与更多的心智进行思想交流的时候重组进化，</strong>甚至说网络也是种特殊的心智，现在人的心智已经和云端相连，互联网成为了我们心智的一部分，和我们原有的心智相融。实施上将来将出现更多人工心智，它们拥有与人类完全不同的思维模式，能产生与我们差异巨大的思想，而思想间的交流会又融合出更加强大的心智，人类心智由此进化，破茧而出。</p>
                <p>人类心智的进化路上一直是奇遇不断。<strong>心智的进化来自于思想的进化，而思想的进化来自于交流融合。思想交流的载体就是“语言”</strong></p>
                <p><strong>人类心智进化的钥匙叫“文字”，文字的强大之处改变了人类对信息进行的编码方式</strong>就是人类心智，在出现书面文字之前我们只能通过口语来交换思想，这种方式的问题是，<strong>口语</strong>是如同长江水东流不复返，且稍纵即逝，我们在去和另外一个人交流思想时只能说出符合对方已经存在认知的词才能被理解，因为我们需要快速关注到正在说的词句并理解，这就<strong>限制了思想内容的深度，我们只能交流那些不需要怎么思考的内容，限制了抽象性</strong>。有时候你心里很清楚，说出来别人怎么也听不懂就是这么回事。</p>
                <p>而<strong>书面文字，使得思想可以永存而不是稍纵即逝，并且使得信息从一条射线的表现形式进化成能够前后反复跳转的线性性结构，从流体变成了固体。借助文字，思想的交流实现了跨越时间空间的能力，生人能和死者进行思想的交流，文字赋予了思想以生命。</strong></p>
                <p>这就使得我们能用更多的时间去进行思考，同时这使得<strong>文字可以做到高度的抽象，高度抽象能够用少的信息量去表达事物之间的规律本质</strong>，这使从口语的叙事型开始向文字的观念型开始转换，<strong>人类开始以范畴而非事件来组织经验，并自觉接受抽象化的训练，这个过程叫用一个词来描述就叫——“思考”</strong>，而这事实上时自我意识的真正起始。书面文字是我们所理解的有意识思考的前提条件，它<strong>触发了自我意识的“灵魂”</strong></p>
                <p><strong>在抽象化的路上走远时，通过严格组织各种范畴和关系，发展出了“逻辑”，逻辑成为了一种判断真假的工具：真理除了来自具体的经验，仅从字面也可以得出。</strong>比如你有A和B，而A和B符合一个被验证过的规律就能得出C，而在“逻辑”诞生之前我们只能知道A和B，C可能要通过偶然才能发现或许机遇没到永远也发现不了，而推理使得我们能根据现有的东西推出C。</p>
                <p><strong>也就是说“逻辑”使得思想本身能够创造比自身跟高一层的思想，并且符合客观规律，能高效得运用到实践中。</strong></p>
                <p><strong>和逻辑并驾齐驱的关键思维方式是语言技巧中的“隐喻”，如果说“逻辑”是真理之火，那么“隐喻”就是创造力之泉，两者似乎水火不容，因为类比永远不可能完全符合逻辑。</strong></p>
                <p>“来源于一股水流的每一个逐步的变化是怎样冲刷出的峡谷的”就是“一个小的进化在经历数千代的改变之后能够造成不同物种之间的巨大变化”的有力隐喻，<strong>中国的语言博大精深也正在于隐喻的运用，如果你非要用逻辑去证明你会发现不可能实现，因为两个概念之前跳跃巨大，却缺少大量的证据去进行证明</strong>。而你思考这段话时你却在直觉上认为这个说法无比可靠而真实。</p>
                <p>“朱丽叶是太阳”是一种充满诗情画意的的隐喻，而“爱即旅程”则属于概念隐喻。<strong>概念隐喻为人类指明了一种最显而易见的方法，人们据此可以学会如何推断出一个全新的、抽象的概念</strong>。</p>
                <p><strong>也就是说“隐喻”使得思想这个像基因一样能重组复制的“模因”，拥有了更强烈的变异方式，没有“逻辑”这种方式稳定安全，却更加具有破坏性与创新性，加速了“模因”的进化</strong>，能在更短的时间里拥有更多的可能性，而自然选择会帮我们选择出那些强大的“模因”，和基因一样。回想历史上每一次伟大的变革，无一破坏性创新，从纸信被取代电报再到电报被电话取代，<strong>没有一个看似是有逻辑的，逻辑是线性的，而隐喻是非线性的，在未发生你根本无法准确预测。</strong></p>
                <p>如果仔细去思考，你会发现一切你能想到的科技进步或者理论都是隐喻的产物，每一次学术上的革命性的突破往往来自于其他领域的启发就是一个典型的例子，就人工智能的神经网络的算法就来自于神经科学的隐喻。</p>
                <p><strong>事实上人工智能在认知上的突破就在于隐喻，而不在于逻辑，事实上谈“逻辑”计算机要比人类出色，而隐喻才是创造力的源泉，人类心智的核心竞争力</strong>。</p>
                <p>以上都是思维方式的改变带来的进化</p>
                <p>事实上思维习惯也对人类的进化产生了巨大的影响。人类的第一个重要的思考习惯就是思考预测未来。</p>
                <p><strong>人类开始学会思考未来这是认知上的大跃迁。</strong>有人会说难道人类之前不思考未来么？动物不思考未来么？动物会存粮过冬就是对于未来采取行动的有利证明，和但其实这是一种习性，根据节气来进行行为的改变，这并非是动物思考出来的。</p>
                <p>人类什么时候开始拥有“未来”这个概念要从采集社会向农业社会转变的过程说起，采集时代，智人活动范围巨大，每天只需要花2-3个小时采集就能填饱肚子，到了农业时代人类的空间缩小，但时间却变长了。一般来说，采集者不会花太多心思去考虑下周或下个月的事情，因为采集者都是现采现吃，不管是保存食物还是积累财务都不是件容易的事情，但农民却会想象预测着未来几年或是几十年的事情来，因为农业受到太多因素的制约，天灾很多，一个错误的决策就可能导致巨大的损失，农民必须生产比需求量大的多的食物来保证遇到天灾时能用储存的粮食养活自己。所以必须预测未来。</p>
                <p><strong>因为对于未来的思考习惯，我们的想象从农业时代开始不再只是去满足去解释那些我们无法理解的东西，我们的想象开始以达成一个长远的目的为最终目的去满足我们的欲望</strong>。</p>
                <p><strong>从想象到现实不是凭空出现的，实现想象就要学会计划。</strong>计划这个第二个重要的思考习惯也伴随着对于未来的思考这一习惯诞生。计划使得我们能把想象的事情给变成现实，如果说想法是天堂，那么计划就是去修一条抵达天堂的路的一种方式。思想——“模因”不再仅仅是存在于大脑这个虚无的时空里，因为计划使得这个特殊的“基因”开始对现实世界产生实质性影响。</p>
                <p>就像基因能通过RNA转录解码后再组成有机物一样，计划就是“模因”的解码方式。基因因为RNA能把DNA遗传信息解码再通过翻译表达为蛋白质，而计划就相当于去解码模因的“RNA”,而翻译的过程就是我们所说的执行。</p>
                <p>动物并非不会计划，只是计划的复杂度远远赶不上人类，因为人类对于计划可以不断进行拆解，而动物却做不到，而正是分解任务的能力限制了计划的复杂度。</p>
                <p>还有一种思维习惯同样是异常强大的力量，至于何时人类开始拥有这个思维习惯各方说法不一，<strong>这种思维习惯就是从多思维视角出发进行思考的习惯</strong>，“横看成岭侧成峰”说得就是这个道理，人类在看待一件事情是从多角度出发思考的，不仅仅是单一的视角。拿程序来举例，如果一个程序仅有一种运行方法，那么一旦这种方法不再适用于该程序，则该程序很快就会陷入停滞。相反，如果一个程序有几种运行方法，一旦其中一种方法出现问题，程序会很快转向使用其他方法或者寻找合适的替代方法。在生活中遇见一个难题时，<strong>大脑能在不同视角之间进行转化</strong>，比如我们常说的“移情”就是一种特别的思考视角，我们会不断的采用新的方式进行尝试，而不是一条路走不通后束手无策。<strong>多样性视角正是人和动物以及过去所制造的机器的主要区别所在。</strong></p>
                <p><strong>在不断使用新的视角去尝试之后会得到反馈，无论结果是失败还是成功，我们都会进行另一种思考叫做反思，得出的结果被称之为经验</strong>，这个能力动物同样是拥有的，就像狗能够被训练一样，然而人类的反思能力却远不止那么简单，因为人类的反思不仅仅是发生在事情发生之后，而更多的是在事情发生之前，和我们的想象逻辑能力完美结合起来，人类会根据之前积累的知识去进行推理，在脑海中模拟事情已经发生，然后估计可能产生的结果并进行反思，这种能力使得人类的经验得到指数级的提升，而动物却不会，动物的经验只能靠事情发生之后的反思来获取。</p>
                <p><strong>实质上人类的反思还有一个更高维度的层次，这个层次叫做自我反思，自我反思不仅会思考最近的想法，也会思考想法的实体机制，也就是说自我反思是在思考反思本身。</strong>认识到自我反思的重要性，就如同认识到自身的困惑一样，是件颇具智慧的事情（与之相反的是已经陷入迷惑却没有意识到），因为只有当我们意识到自我的困惑时，才会知道该升华动机和目标了。</p>
                <p>以上就是人类智能的进化之路，奇遇不断，那些看似巧合的事情其实也许都是必然的结果。<strong>智能的进化之路并不能让你准确的预测人类的未来，却可以让你看到必然的趋势。</strong></p>
                <p>几百万年前人类在进化的分支树中，选择了与其他物种完全不一样的进化方向，放弃了肉体上的进化把更多资源投入到智能的进化，这个冒险的举动在那个靠力量生存的自然世界简直就是一个笑话，但人类却通过智能的进化超越基因的进化成为了地球的主宰。</p>
                <p>智能进化的脚步不断的加快，智能进化的归宿是什么依然只是个想象。</p>
                <p>现在人类已经站在了进化的岔路口，即将迈出下一步，脑联网、人机社会、机器取代人类、基因改造，终点是地狱还是天堂我们一无所知，充满恐惧又无限向往。对于我们只希望获取个人幸福的个体来说，跟着趋势走，走在大多数人前面一定是更好的选择。</p>
                <p>转载：<a href='https://zhuanlan.zhihu.com/p/21996106' target='_blank' >https://zhuanlan.zhihu.com/p/21996106</a></p>
                <p>&nbsp;</p>
            </div>
        );
    }
}

export default PeopleHistory;