import React, { Component } from 'react';

import Markdown  from 'react-markdown';



class TalkWY extends Component {
    render() {
        return (
            <div>
                <Markdown source={"# 和女朋友聊天如何避免一问一答式的对话？\n" +
                "\n" +
                " 怎么避免一问一答式的对话呢？**很简单啊，不要抛问句啊！**\n" +
                "\n" +
                "很多人以为以问句结束自己的发言，对方就得回答问题，那么对话就得以延续。这种想法简直是太自作聪明啦。**真相是女生讨厌问题。**\n" +
                "\n" +
                "男生的发言倾向于获取信息（形式为提问），或者是解决问题（形式为回答），所以容易产生对答感，会评估是否有效的传递了有效信息，有时还会试图说教方式指导对方，而这些都很沉重，无法愉快的交谈。而女生的倾向则是分享感受。很多话她们说出来没有目的的，就是想说而已，想跟旁边的人分享一下此时此刻心里想到的而已。\n" +
                "\n" +
                "**所以能和女生产生共鸣的对谈，必要的成分是分享感受。**\n" +
                "\n" +
                "举个例子。\n" +
                "\n" +
                "妹子：买的草莓不怎么好吃。\n" +
                "一般聊法：这个季节草莓都不怎么好的，要想吃好的草莓得到春天。（不要说教）\n" +
                "作死聊法：可这不是你自己要买的么？（质问最讨厌了）\n" +
                "高级聊法：我刚刚吃了两个，是不怎么样。下次给你买好的吧，这回的你别吃了全给我吃。（妹子：想得美~休想独吞<(￣︶￣)>）\n" +
                "\n" +
                "评论里有人提问说假如不是情侣关系的两个人，这个高级聊法会不会太过亲密了。那么我们去掉后面的一半，只说【我刚刚吃了两个，确实不怎么样。】那么这个对话也比一般聊法亲近。\n" +
                "\n" +
                "汉子：我刚刚吃了两个，确实不怎么样。\n" +
                "妹子：就是~~烂趴趴的！\n" +
                "汉子：你越说我就越想吃新鲜的草莓了……\n" +
                "妹子：我想吃草莓！\n" +
                "汉子：【指】那边有个甜品店，门口海报草莓双皮奶……\n" +
                "妹子：走走走。\n" +
                "\n" +
                "总之，不要说教，不要比较，不要评价，尽量少提问，尽量让语境变得轻松愉快一点。\n" +
                "\n" +
                "---\n" +
                "\n" +
                "再来个例子，还记得朱莉和戴普之前的电影游客中，两人在火车上的偶遇么？有这样一段对话很有意思。\n" +
                "\n" +
                "```\n" +
                "安吉朱莉对男主角说：“你请我吃饭吧”。\n" +
                "他说：“我可以请你吃饭吗？”\n" +
                "她说：“女人不喜欢被提问”。\n" +
                "他说：“和我去吃饭”\n" +
                "她说：“太鲁莽”\n" +
                "他说：“和我一起吃饭好吗？”\n" +
                "她说：“你又提问了。”\n" +
                "他说：“我想要吃饭，但没有你我吃不下”。\n" +
                "```\n" +
                "\n" +
                "我想吃饭，没有你我吃不下。一句话就将目标包裹在感受分享当中了。\n" +
                "\n" +
                "---\n" +
                "\n" +
                "1、“最近柴静的那个纪录片挺火的啊，我觉得蛮好看的。”这样开始。那么妹子下一句话可能是“我也看了，挺触动的，balabalabala.”或者是“没看过呢，讲什么的？”你们的对话依旧可以延续。\n" +
                "\n" +
                "也就是说，**想要知道对方对事件A的态度如何，可以先表达自己对事件A的一点点想法（注意不要偏激），抛砖引玉一下，对方会顺着你的话头往下说的。**这样你们的话题就可以不断延续。\n" +
                "\n" +
                "2、实在需要提问的时候，不要提攻击性太强的问题。\n" +
                "\n" +
                "你月收入有多少？你身高多少？结婚后家务谁干？打算什么时候生孩子？生几个？咱结婚买多大的房？房产证上写谁名字？婚后要不要跟婆婆一起住？\n" +
                "\n" +
                "以上这些问题都太赤裸了，攻击性极强，女生会觉得自己被物化，数据化，很没安全感，十万个讨厌。\n" +
                "\n" +
                "要是女生问你JJ多长？生孩子保大保小？咱结婚你给我妈多少聘礼？你也会觉得很失礼的。\n" +
                "\n" +
                "那么**要提问的时候，尽量委婉一点，目的性模糊一点，问问对方的感受想法而非标准和态度。**\n" +
                "\n" +
                "举个例子。关于孩子吧。\n" +
                "\n" +
                "你们约在咖啡馆，聊着聊着你目送旁边走过的小萝莉走过去。\n" +
                "汉子：你看刚刚那个小萝莉，是不是挺可爱的？\n" +
                "妹子：小孩都很可爱啊，就这个年纪最好玩了。（你妹子挺喜欢小孩的，可能婚后比较快就会要小孩）\n" +
                "汉子：看来你会是个好妈妈的，对吧？\n" +
                "\n" +
                "另一种可能性\n" +
                "\n" +
                "汉子：你看刚刚那个小萝莉，是不是挺可爱的？\n" +
                "妹子：哎呀妈呀小孩子吵死了，我一看到孩子就头大。（你妹子不是很喜欢小孩）\n" +
                "汉子：可能别人的小孩没感情，没准自己养的就会怎么看怎么喜欢。\n" +
                "妹子：那是当然啦，毕竟是自己孩子。（她并不是很讨厌小孩，也许只是比较讨厌熊孩子）\n" +
                "或者妹子说：所有小孩都很吵，我没见过不哭不闹的小孩子。（你有可能要丁克了）\n" +
                "\n" +
                "**至于非要很赤裸的提问才能得到确切答案的问题，等你们熟悉一点之后再提吧。**\n" +
                "\n" +
                "3、问题不要太密集，**不要追问**，问题之间穿插一些自己的想法。\n" +
                "\n" +
                "我们不喜欢你叫什么名字？你多大？你在哪上班？你平时有哪些爱好？\n" +
                "\n" +
                "你又不是燕小六，能不能不要追着人查户口啊。\n" +
                "\n" +
                "思考回答每一个问题的得体答案是要耗费脑细胞的，一连串这么多问题真是让人够神经紧张的。要想获取信息你不妨换一种方式。\n" +
                "\n" +
                "你好，我叫XXX，你呢？\n" +
                "\n" +
                "我今年本命年，24岁，你看红绳转运珠，咦，你没有带呢，我猜你比我小，你23？（如果不对的话妹子会直接说出年纪了）。\n" +
                "\n" +
                "我刚工作2年，在XXX企业上班，经验不是很丰富，领导也很斯巴达，有时候上班觉得累的够呛啊~（妹子可能会附和说对啊对啊我们领导也很鬼畜的！）你就可以问，对了你在哪里上班来着？\n" +
                "\n" +
                "XXX（共同的朋友，或者介绍人）跟我是多年的好哥们儿了，他女朋友跟你很熟啊，上回听嫂子说你喜欢看电影啊是不是真的啊？有空一起看吧，最近上映了XXXX。\n" +
                "\n" +
                "一样是问了四个问题，下面这种是不是比上面的追问看着好很多啊~又达到了目的，又获得了信息，对方也不会因为被追问逼太紧而讨厌你\n" +
                "\n" +
                "----\n" +
                "\n" +
                "关注聊天本身，而不是聊天话题\n" +
                "\n" +
                "很多人都不知道怎么和女孩聊天 往往说着说着就没有了话题 而我认为：聊天根本就不需要准备话题！\n" +
                "\n" +
                "我可以不做任何准备，没有事先准备任何话题的情况下，和一个女孩聊一个通宵，理论上说，女孩想要和你聊多长时间，我就能和她聊多长时间：\n" +
                "\n" +
                "话题式聊天法：\n" +
                "\n" +
                "​\t我们聊天的时候总是想要围绕着我们事先想的话题展开，而并没有关注聊天本身于是我们经常会出现以下情况：\n" +
                "举例：\n" +
                "\n" +
                "```\n" +
                "我：你吃饭了吗？ （提出一个话题）\n" +
                "MM：吃了\n" +
                "我：你在干什么呢？ （又提出一个话题）\n" +
                "MM：上网\n" +
                "我：你那天气好吗？  （又提出一个话题）\n" +
                "MM：还可以\n" +
                "我：你最近忙吗？  （又提出一个话题）\n" +
                "MM：不忙\n" +
                "我：。。。。   （没话题可讲了，因为话题总有讲完的时候）\n" +
                "我：哦，这样啊，我就想打电话问问你在干什么，那你继续忙吧，拜拜\n" +
                "MM：拜拜\n" +
                "```\n" +
                "\n" +
                "因为此时你脑子里面想的总是，我该说些什么呢？和MM聊些什么话题呢？这样往往就进入了死胡同，当你事先准备的话题说完后，你就发现，你哑巴了！\n" +
                "\n" +
                "而正确的聊天思想是：去关注聊天的本身，而不是聊天的话题，不是聊什么的问题，而是怎么去聊的问题\n" +
                "\n" +
                "关键词法聊天：\n" +
                "举例\n" +
                "\n" +
                "```\n" +
                "我：你吃饭了吗？（提出一个话题）  （关键词：吃饭 饭）\n" +
                "MM：吃了啊\n" +
                "我：吃的什么啊？（由关键词 吃饭 引发  ）\n" +
                "MM：牛肉面啊 \n" +
                "我：你自己做的吗？（由关键词 饭 引发）\n" +
                "MM：我不会做饭也，买的啊  （关键词：不会做饭 买）\n" +
                "我：你都不会做饭嘛，一个女孩子家家，连饭都不会做，看你怎么嫁的出去（由关键词 不会做饭 引发 出现新的关键词 嫁）\n" +
                "MM：不想做，以前都是妈妈做的 （关键词：以前 妈妈）\n" +
                "我：以前是以前嘛 现在是现在 你已经长大了啊 女孩子要学会做饭的 你当人家老婆 不做饭的吗？ （由关键词 以前 引发 出现新的关键词 长大 老婆 ）\n" +
                "MM：我还没想好嫁人呢。。。（关键词 嫁人）\n" +
                "我：你妈妈很疼你吧 （由关键词 妈妈 引发 出现新的关键词 疼 ）\n" +
                "MM：我妈妈很疼我的啊。我是最小的嘛 当然疼我了 （关键词：最小 ）\n" +
                "我：你是最小的？你还有兄弟姐妹?  （由关键词 最小 引发 出现新的关键词 兄弟姐妹 ）\n" +
                "MM：我姐姐啊 BLABLABLAL。。。。（一大堆）\n" +
                "```\n" +
                "\n" +
                "走到这里 发现这里的关键词用的差不多了 马上返回到更早谈话时的 关键词 嫁  **可以用上层  上上层 的谈话时出现的关键词展开聊天！**\n" +
                "\n" +
                "```\n" +
                "我：你现在还没想过要嫁给什么样的人吗？ （由关键词 嫁 引发  ）\n" +
                "MM：还没想好呢 BLABLABLAL。。。。（一大堆） （关键词：没想好）\n" +
                "我：那你的标准是什么呢? （由关键词 没想好 引发  ）\n" +
                "MM:我的标准嘛是。。 BLABLABLAL。。。。（一大堆） \n" +
                "```\n" +
                "\n" +
                "这个时候发现她讲的话里面没有关键词了 或者说这里的关键词不利于你展开话题  马上返回到更早谈话时的 关键词  展开聊天！例如 第6行的关键词 买 \n" +
                "\n" +
                "```\n" +
                "我：你喜欢买东西，喜欢去购物吗？ （由更早的关键词 买 引发 出现新的关键词 购物）\n" +
                "MM：喜欢啊 超级喜欢的 （关键词：喜欢）\n" +
                "我：那你还喜欢干什么？（由关键词 喜欢 引发 ）\n" +
                "MM：喜欢唱歌，游泳，旅游啊  （出现新的关键词：唱歌，游泳，旅游） \n" +
                "我：哦 你喜欢唱歌 你喜欢唱谁的歌呢？\n" +
                "MM：。。。。。\n" +
                "我：哦 你喜欢游泳 你会游泳？ 你游泳技术怎么样？你一般在那游？\n" +
                "MM：。。。。。\n" +
                "我：哦你喜欢旅游 你都旅游过那些地方？感觉怎么样？\n" +
                "MM：。。。。。\n" +
                "```\n" +
                "\n" +
                "不要一直在一个关键词上纠缠下去 抓住一个关键词开聊 聊到一定程度 停！ 返回上一个关键词开聊 聊到一定程度 停！ 返回上一个聊到一半的关键词继续聊完 停！ 返回至上上一个关键词开聊 聊到一定程度 停！返回至上上上一个关键词聊。。。。。。  \n" +
                "\n" +
                " 你会发现 在整个聊天过程中 你没有去准备什么话题 而聊天本身就会给你带来无数的话题！你不需要准备 随时随地 都可以开始聊天 你不会有压力 你不会绞尽脑汁去想我该去聊什么？因为你会有无数的话题 多到你都不知道该选择什么去聊\n" +
                "\n" +
                "重要的是，你有话可说，并且进入了一种良好得聊天气氛，和MM聊什么并不重要，重要得是，在这种气氛中，是好玩有趣的，互相调侃的，幽默的聊天。  \n" +
                "\n" +
                "当然，这一系列的啰啰嗦嗦好像并没有重点，没有营养可言，而我要说的是，这只是一个例子，让和女孩说话时只有几句话的AFC们能有话可说，不至于冷场，我也不会就一直这么问下去，这个过程应该是互动的，我只能说，这个只是一个聊天的骨架，而要让聊天有趣起来，就必须加入框架，推拉，冷读，DHV故事，惯例使其丰满起来，使聊天有意义起来 。\n" +
                "\n" +
                "---\n" +
                "\n" +
                "Cold reading直译过来称为“冷读”。女孩最讨厌查户口式的问题。你多大了？你是哪里人？你叫什么名字？很可惜大部分人依然只会这种表面的聊天模式。如果你会冷读，就不会有这个问题。**cold 有着没有准备的意思，reading有着读心、占心的意思，冷读术就是指在没有防备，甚至第一见面时看透他人的心思，从而更好的与人交流，经常被心理医生应用于心理治疗。** 转换成冷读就是：“你一定有在国外留过学。”\n" +
                "\n" +
                "比如：“你是不是在国外留过学？”这是一句普通的问句。\n" +
                "\n" +
                "转换成冷读就是：“如果我没看错，你的人缘一定不错吧~”\n" +
                "\n" +
                "但是用冷读的方式，对方就可能会有很多种回答，比如：你是怎么知道的？/没有，为什么你会这么说？/那你知道我在哪个国家吗？\n" +
                "\n" +
                "但是用冷读的方式就不一样了：啊！你是怎么知道的！/没有，其实我朋友不多的。\n" +
                "\n" +
                "**那就是冷读必须用陈述句。**\n" +
                "\n" +
                "冒牌算命师或假通灵者这些骗子，都是怎么骗人的呢？依照常理来说，应该没有人会相信才第一次见面的可疑人士所说的话。但是，为什么就有人会轻易相信那些怎么想都很可疑的说词呢？\n" +
                "\n" +
                " \n" +
                "\n" +
                "成为读心者（cold reader）的四大要素\n" +
                "\n" +
                "在开始技术层面的内容前，我想先说明实践冷读术时的要素，或许也可以说是一种必须具备的心态。\n" +
                "　　　要素一　维持解释而不是猜测的心态\n" +
                "　　　**要素二　让对方说他想说的话**\n" +
                "　　　**要素三　说对方想听的话**\n" +
                "　　　**要素四　将对方视为独一无二的人，对对方的一切都感到惊喜**　\n" +
                "\n" +
                "《皇家赌场》中007用到过冷读的片段：\n" +
                "\n" +
                "```\n" +
                "Well, your beauty's a problem. You worry you won't be taken seriously. 你的美貌是个问题。你担心别人不会认真看待你。\n" +
                "```"}/>
            </div>
        );
    }
}

export default TalkWY;